# SQL Databases
This notebook will be used to learn about SQL databases and how we can CRUD (Create, Read, Update, Delete) via Python.

I want to understand how I can CRUD via Python so that the Streamlit UI can be used to enter and read information from future users.

In [51]:
import sqlite3
import pandas as pd

### Connecting to a Local Database
The sqlite3 module provides a straightforward interface for interacting with SQLite databases. A connection object is created using sqlite3.connect(); the connection must be closed at the end of the session with the .close() command. While the connection is open, any interactions with the database require you to make a cursor object with the .cursor() command. The cursor is then ready to perform all kinds of operations with .execute().

In [52]:
# Create connection to local database
con = sqlite3.connect(r'C:\Users\Jaume\DataGripProjects\Golf\identifier.sqlite')
cur = con.cursor()

for row in cur.execute('SELECT * FROM course;'):
    print(row)

('Golf Costa Daurada', 18, 'Tarragona', 121.0, 69.7, 1, None)
('Loch Palm Golf Club', 18, 'Kathu', 129.0, 68.4, 3, None)
('Red Mountain Golf Club', 18, 'Kathu', 121.0, 68.4, 5, None)
('Aravell', 18, '', 0.0, 0.0, 6, 0)
('Aravell', 18, 'Aravell', 0.0, 0.0, 7, 0)
('Aravell Golf Club', 18, 'Aravell', 0.0, 0.0, 8, 0)
('Aravell Golf Club', 18, 'Aravell', 0.0, 74.0, 9, 0)
('Aravell Golf Club', 18, 'Aravell', 139.0, 74.0, 10, 0)
('Aravell Golf Club', 18, 'Aravell', 139.0, 74.0, 11, 71)
('Aravell Golf Club', 18, 'Aravell', 139.0, 74.0, 12, 71)
('Aravell Golf Club', 18, 'Aravell', 139.0, 74.0, 13, 71)

### Inserting
We use a parameterized query to insert Python variables into the table. Using a parameterized query, we can pass python variables as a query parameter in which placeholders (?)

In [3]:
NAME = "Loch Palm Golf Club"
HOLE_18 = 1
CITY = "Kathu"
SLOPE = 129
RATING = 68.4

sqlite_insert_with_param = """INSERT INTO course
                  (name, holes_18, city, slope, rating)
                  VALUES (?, ?, ?, ?, ?);"""
data_tuple = (NAME, HOLE_18, CITY, SLOPE, RATING)
cur.execute(sqlite_insert_with_param, data_tuple)
con.commit()
print("Python Variables inserted successfully into table")

def insert_course(name, holes_18, city, slope, rating):
    """
    Function inserts a golf course entry into the course table
    :param name:
    :param holes_18:
    :param city:
    :param slope:
    :param rating:
    :return:
    """
    sqlite_insert_with_param = """INSERT INTO course
                  (name, holes_18, city, slope, rating)
                  VALUES (?, ?, ?, ?, ?);"""
    data_tuple = (name, holes_18, city, slope, rating)
    cur.execute(sqlite_insert_with_param, data_tuple)
    con.commit()
    print("Python Variables inserted successfully into table")

Python Variables inserted successfully into table

In [4]:
# Insert course
NAME = "Red Mountain Golf Club"
HOLE_18 = 1
CITY = "Kathu"
SLOPE = 121
RATING = 68.4

insert_course(NAME, HOLE_18, CITY, SLOPE, RATING)

Python Variables inserted successfully into table

In [5]:
# SQL table to Pandas DataFrame
df = pd.read_sql_query("SELECT * FROM course", con)
df.head()

def db_refresh(con):
    """
    Function calls the connection and returns the table as a dataframe
    :param con:
    :return:
    """
    df = pd.read_sql_query("SELECT * FROM course", con)
    return df

In [6]:
# Database refresh
db_refresh(con)

                     name  holes_18       city  slope  rating  id   par
0      Golf Costa Daurada        18  Tarragona  121.0    69.7   1   NaN
1     Loch Palm Golf Club        18      Kathu  129.0    68.4   3   NaN
2  Red Mountain Golf Club        18      Kathu  121.0    68.4   5   NaN
3  Masia Bach - Executive         9  Barcelona  106.0    30.0   6  32.0
4       Aravell Golf Club        18    Aravell  139.0    74.0   7  71.0
5     Loch Palm Golf Club         1      Kathu  129.0    68.4   8   NaN
6  Red Mountain Golf Club         1      Kathu  121.0    68.4   9   NaN

### Deleting

In [7]:
cur.execute('''
                DELETE FROM course
                WHERE id in (6, 7, 8, 9)
               ''')
con.commit()

In [8]:
# Database refresh
db_refresh(con)

                     name  holes_18       city  slope  rating  id   par
0      Golf Costa Daurada        18  Tarragona  121.0    69.7   1  None
1     Loch Palm Golf Club        18      Kathu  129.0    68.4   3  None
2  Red Mountain Golf Club        18      Kathu  121.0    68.4   5  None

In [9]:
con.close()

## C.R.U.D
- Par
- Distance
- Stroke Index

In [25]:
course_score_card_df = pd.read_csv(r"C:\Users\Jaume\Documents\Python Projects\golf\data\interim\golf_course_score_card_aravell.csv")
course_score_card_df.head()

   Hole  Distance  Par  Stroke Index               Name
0     1       357    4             2  Aravell Golf Club
1     2       153    3            10  Aravell Golf Club
2     3       283    4            18  Aravell Golf Club
3     4       411    5            16  Aravell Golf Club
4     5       328    4            12  Aravell Golf Club

### Adding Row to Par
This section will create a function that will read the file uploaded by a user and update the PAR table with the appropriate values

In [61]:
def insert_par(name, par, table):
    """

    :param name:
    :param par:
    :return:
    """
    if len(par) == 9:
        sqlite_insert_with_param = """INSERT INTO {}
                  (course_id, hole1, hole2, hole3, hole4, hole5, hole6, hole7, hole8, hole9)
                  VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?);""".format(table)
        par = [str(x) for x in par_hole_par]
        list_before_tuple = [name] + par
        data_tuple = tuple(list_before_tuple)
    elif len(par) == 18:
        sqlite_insert_with_param = """INSERT INTO {}
                      (course_id, hole1, hole2, hole3, hole4, hole5, hole6, hole7, hole8, hole9, hole10, hole11, hole12, hole13, hole14, hole15, hole16, hole17, hole18)
                      VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);""".format(table)
        par = [str(x) for x in par_hole_par]
        list_before_tuple = [name] + par
        data_tuple = tuple(list_before_tuple)
    cur.execute(sqlite_insert_with_param, data_tuple)
    con.commit()
    print("Python Variables inserted successfully into table")

In [63]:
par_course_name = course_score_card_df["Name"].iloc[0]
par_hole_par = (course_score_card_df["Par"])
par_hole_par = [str(x) for x in par_hole_par]

[par_course_name] + par_hole_par

insert_par(par_course_name, par_hole_par, "par")

Python Variables inserted successfully into table

### Generalising the Function
We can evolve the function above to work for the *Par, Distance* and *Stroke Index* table

In [64]:
def make_data_tuple_hole9(table, course_name, course_feature):
    """

    :param table:
    :param course_name:
    :param course_feature:
    :return:
    """
    sqlite_insert_with_param = """INSERT INTO {}
                  (course_id, hole1, hole2, hole3, hole4, hole5, hole6, hole7, hole8, hole9)
                  VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?);""".format(table)
    str_course_feature = [str(x) for x in course_feature]
    list_before_tuple = [course_name] + str_course_feature
    data_tuple = tuple(list_before_tuple)
    return sqlite_insert_with_param, data_tuple

def make_data_tuple_hole18(table, course_name, course_feature):
    """

    :param table:
    :param course_name:
    :param course_feature:
    :return:
    """
    sqlite_insert_with_param = """INSERT INTO {}
                      (course_id, hole1, hole2, hole3, hole4, hole5, hole6, hole7, hole8, hole9, hole10, hole11, hole12, hole13, hole14, hole15, hole16, hole17, hole18)
                      VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);""".format(table)
    str_course_feature = [str(x) for x in course_feature]
    list_before_tuple = [course_name] + str_course_feature
    data_tuple = tuple(list_before_tuple)
    return sqlite_insert_with_param, data_tuple


def insert_score_card_feature_to_table(table, course_name, course_feature):
    """

    :param name:
    :param par:
    :return:
    """
    if len(course_feature) == 9:
        sqlite_insert_with_param, data_tuple = make_data_tuple_hole9(table, course_name, course_feature)
    elif len(course_feature) == 18:
        sqlite_insert_with_param, data_tuple = make_data_tuple_hole18(table, course_name, course_feature)
    cur.execute(sqlite_insert_with_param, data_tuple)
    con.commit()
    return None